{"version":"1.0.0","name":"Kendricks Camille","email":"kccollege1@outlook.com","phone":"+1-XXX-XXX-XXXX","additionalText":"","contacts":[{"name":"Github","url":"https://github.com/KendricksLCamille"},{"name":"LinkedIn","url":"https://www.linkedin.com/in/kendricks-c-209988147/"}],"education":[{"degreeType":"A.S.","category":"Science","name":"Palm Beach State College","city":"Lake Worth","state":"FL","date":"2016-06"},{"degreeType":"B.S.","category":"Computer Engineering","name":"Florida Polytechnic University","city":"Lakeland","state":"FL","date":"2018-12"},{"degreeType":"Certificate","category":"","name":"Microsoft Office 2013 Specialist","city":"","state":"","date":""}],"experience":[{"category":"Work Experience","title":"Senior Software Engineer","url":"https://maxprojections.com/","company":"MaxProjections","location":"Remote","startDate":"2022-06","endDate":"2025-06","summary":"Led the development and upgrade of a financial modeling web application that streamlines complex Excel processes into a robust, user-friendly platform and develops reusable financial models.","details":"I led the system upgrades from .NET 6 to .NET 10, and moved from Bootstrap 4 to Bootstrap 5. These upgrades improved system stability, enabled us to use new features, enhanced application performance, and kept us on the latest technology.\n\nI used HTML, CSS, Bootstrap, and JavaScript to develop the user interface (UI) and user experience (UX) for creating financial models. This allowed users to create, share, and modify their models easily.\n\nI hosted the application on Amazon Web Services (AWS) Elastic Compute Cloud (EC2) Fargate to ensure high availability and reliability for the client.\n\nI taught team members how to develop the application and explained the reasons behind our methodologies to ensure a cohesive and efficient development process.\n\nI used Blazor, ASP.NET, and JavaScript to build the UI, add visual enhancements, and manage the state between the client and server. This resulted in faster development, reusable components, and a more responsive application.\n\nI wrote queries for a MySQL database hosted on AWS Relational Database Service (RDS) with Amazon Aurora, to handle data filtering, feature restrictions, and user resource access. This improved data management and security.\n\nI used AWS CloudFormation and AWS Elastic Container Service (ECS) to monitor deployment status, troubleshoot issues, and cancel unintended deployments. This helped us monitor deployments, revert changes, and fix errors quickly.\n\nI used AWS Route 53 to direct traffic to our services, such as the web application and API, ensuring users could access the application through a user-friendly URL.\n\nI used AWS Cognito to manage user credentials and linked it with AWS RDS MySQL, which secured user authentication and protected sensitive data.\n\nI developed core systems for the application using C# (C-Sharp), which simplified UI component creation with Blazor and maintained data consistency across systems.\n\nI built the core financial API to ensure it was reliable and easy to use. I organized responses with tags to help users navigate and filter data easily.\n\nI implemented OAuth 2.0 (Open Authorization 2.0) to establish secure user authentication, safeguarding access to sensitive financial data.\n\nI created Swagger documentation to provide an interactive API exploration tool, making UI testing and client integration easier.\n\nI integrated with QuickBooks to automate data entry for financial models, developing custom extraction methods to address gaps in the QuickBooks API documentation so the application can extract data from the users previous financial models so the client wouldn't have to type the information in twice.\n\nI used EPPlus to generate high-quality Microsoft Excel reports that matched handcrafted templates, preserving embedded formulas for manual adjustments."},{"category":"Work Experience","title":"Software Engineer","url":"","company":"J.P. Morgan Chase","location":"Plano, TX","startDate":"2019-07","endDate":"2022-06","summary":"","details":"Used Python and JSON to create a tool that would generate proxies that save my team over 40 hours of labor per proxy needed to be developed.\n\nConverted soon to be depreciated application into Technical Documentation to provide a framework for what the replacement application must be able to do and how to implement it.\n \nUsed APIGEE (API Gateway / Proxy), to quality of life features to legacy proxies providing users a modern interface to legacy resources.\n\nUsed OAuth, to only allow authenticated users access to resources while allowing the legacy proxy be left unchanged.\n\nUsed CICD, to update and check proxies allowing the system to automatically update resources upon task completion and test confirmation.\n\nUsed JavaScript to add custom features like encryption and decryption to legacy proxies if they require additional protection."},{"category":"Project","title":"Type-Safe Printf in C","url":"https://gitlab.com/funsies1/totally-april-fool-not-actually-trying-to-make-a-foratting-library/-/tree/master?ref_type=heads","company":"","location":"Home","startDate":"2023-03","endDate":"2023-04","summary":"Used the C Macro system and a Trie data structure to develop a function-like macro proof of concept to allow python like type-safe auto correcting string formatting and printing with named parameters and indexes in the C language. ","details":""},{"category":"Contract","title":"Freelancer","url":"https://github.com/KendricksLCamille/Payroll-Application","company":"PrimeCo Electric Inc.","location":"Remote","startDate":"2021-04","endDate":"2025-08","summary":"Developed a comprehensive payroll application that automates wage calculations, tax withholding, and check generation, including detailed pay-stubs for clients.","details":"Utilized C# to implement robust business logic, ensuring accurate and efficient payroll processing.\n\nDesigned an intuitive user interface with Windows Presentation Foundation (WPF) for rapid development and seamless integration with Windows resources and APIs.\n\nEmployed SQLite for persistent storage of application state, enabling reliable archiving and retrieval of payroll data.\n\nPorted of the application to Java and JavaFX for cross-platform compatibility, successfully adapting the core functionalities and UI components.\n\nDemonstrated creative problem-solving by developing an innovative method to convert language printing coordinates to physical coordinates, using a ruler to accurately map and facilitate easy printing of pay-stubs."},{"category":"Contract","title":"Freelancer","url":"","company":"KetroCare Inc.","location":"Remote","startDate":"2022-02","endDate":"","summary":"A secure, scalable web application to support all the needs of a Home Health Care Agency, focusing on core logic, reusable interfaces, and reliable data management.","details":"Implementing core business logic using C# and Java, including processing user inputs, data linkage, and UI integration for dynamic content.\nDeveloping reusable UI components with Blazor and Thymeleaf, ensuring consistent behavior and input validation.\nHosting applications on Microsoft Azure, providing high reliability and availability for clients, employees, and patients.\nManaging data storage with SQLite during development and transitioning to SQL Server and Azure SQL for testing and production, covering customer testimonials, provider applications, and regulatory documentation.\nUtilizing JQL, JPA, Entity Framework Core (EFC), and LINQ to abstract database access, enabling efficient data parsing and filtering across multiple database systems.\nBuilding static UI components using HTML, CSS, and JavaScript, leveraging Bootstrap for responsiveness and consistency.\nImplementing authentication and role-based access control with Identity Framework and Spring Security, ensuring fine-grained security for web resources."}],"tags":[{"string":"[C][ ]","isRegex":true},{"string":"[Rr]elational [Dd]atabase(?: [Ss]ystem)?|[Ss][Qq][Ll]","isRegex":true},{"string":"Macro","isRegex":false},{"string":"(F#|C#|.NET|dotNet)( ?\\d+)?","isRegex":true}]}